Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныНоменкларуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменкларуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыНаименованиеПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	ЦенаИзРегистра = ПолучитьЦенуНоменклатурыНаСервере(СтрокаТаблицы.Номенклатура);
	
	Если ЦенаИзРегистра > 0 Тогда
		СтрокаТаблицы.Стоимость = ЦенаИзРегистра;
	КонецЕсли;
	
	ПересчитатьСтрокуТаблицы(СтрокаТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСтрокуТаблицы(СтрокаТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтоимостьПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСтрокуТаблицы(СтрокаТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСтрокуТаблицы(СтрокаТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуТаблицы(СтрокаТаблицы)
	
	СтрокаТаблицы.Сумма = СтрокаТаблицы.Стоимость * СтрокаТаблицы.Количество;
	
	ПроцентНДС = 0;
	Если СтрокаТаблицы.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		ПроцентНДС = 20;
	ИначеЕсли СтрокаТаблицы.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		ПроцентНДС = 10;
	ИначеЕсли СтрокаТаблицы.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС3") Тогда
		ПроцентНДС = 3;
	КонецЕсли;
	
	СтрокаТаблицы.СуммаНДС = Окр((СтрокаТаблицы.Сумма * ПроцентНДС) / 100, 2);
	
	СтрокаТаблицы.СуммаСНДС = СтрокаТаблицы.СуммаНДС + СтрокаТаблицы.Сумма;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатурыНаСервере(ВыбраннаяНоменклатура)
	
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЦеныНоменкларуры.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменкларуры КАК ЦеныНоменкларуры
		|ГДЕ
		|	ЦеныНоменкларуры.Номенклатура = &Номенклатура";
		
	Запрос.УстановитьПараметр("Номенклатура", ВыбраннаяНоменклатура);
	Выборка = Запрос.Выполнить().Выбрать(); 	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь); 
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина); 
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	// Передаем владельцем именно вашу таблицу «Товары»
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Товары);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Отменяем стандартный одиночный перенос платформы
	СтандартнаяОбработка = Ложь;
	
	// Собираем выбранные товары в массив
	МассивТоваров = Новый Массив;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		МассивТоваров = ВыбранноеЗначение;
	Иначе
		МассивТоваров.Добавить(ВыбранноеЗначение);
	КонецЕсли;
	
	// Заполняем вашу табличную часть «Товары»
	Для Каждого ТекТовар Из МассивТоваров Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекТовар) Или ЭтоГруппаНоменклатуры(ТекТовар) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ТекТовар;
		НоваяСтрока.Количество = 1; // Базовое количество
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоГруппаНоменклатуры(СсылкаНаТовар)
	// Проверяем на сервере, не папка ли это
	Возврат СсылкаНаТовар.ЭтоГруппа;
	
КонецФункции
